---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BoundaryConditionsType.Line
enum: Autodesk.Revit.DB.Structure.BoundaryConditionsType
zh: 线、直线
source: html/8cd53f01-4670-e13b-6431-0260dae7246a.htm
---
# Autodesk.Revit.DB.Structure.BoundaryConditionsType.Line

**中文**: 线、直线

Line Boundary Conditions